{
	"format": "layers-model",
	"generatedBy": "keras v2.4.0",
	"convertedBy": "TensorFlow.js Converter v3.19.0",
	"modelTopology": {
		"keras_version": "2.4.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Functional",
			"config": {
				"name": "model",
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_input_shape": [
								null,
								200,
								200,
								3
							],
							"dtype": "float32",
							"sparse": false,
							"ragged": false,
							"name": "input_1"
						},
						"name": "input_1",
						"inbound_nodes": []
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d",
							"trainable": true,
							"dtype": "float32",
							"filters": 16,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d",
						"inbound_nodes": [
							[
								[
									"input_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization",
						"inbound_nodes": [
							[
								[
									"conv2d",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu",
						"inbound_nodes": [
							[
								[
									"batch_normalization",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_1",
							"trainable": true,
							"dtype": "float32",
							"filters": 32,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_1",
						"inbound_nodes": [
							[
								[
									"max_pooling2d",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_1",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization_1",
						"inbound_nodes": [
							[
								[
									"conv2d_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_1",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_1",
						"inbound_nodes": [
							[
								[
									"batch_normalization_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_1",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d_1",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_2",
							"trainable": true,
							"dtype": "float32",
							"filters": 64,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_2",
						"inbound_nodes": [
							[
								[
									"max_pooling2d_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_2",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization_2",
						"inbound_nodes": [
							[
								[
									"conv2d_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_2",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_2",
						"inbound_nodes": [
							[
								[
									"batch_normalization_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_2",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d_2",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_3",
							"trainable": true,
							"dtype": "float32",
							"filters": 128,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_3",
						"inbound_nodes": [
							[
								[
									"max_pooling2d_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_3",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization_3",
						"inbound_nodes": [
							[
								[
									"conv2d_3",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_3",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_3",
						"inbound_nodes": [
							[
								[
									"batch_normalization_3",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_3",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d_3",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_3",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_4",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_4",
						"inbound_nodes": [
							[
								[
									"max_pooling2d_3",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_4",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization_4",
						"inbound_nodes": [
							[
								[
									"conv2d_4",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_4",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_4",
						"inbound_nodes": [
							[
								[
									"batch_normalization_4",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_4",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d_4",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_4",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_5",
							"trainable": true,
							"dtype": "float32",
							"filters": 256,
							"kernel_size": [
								3,
								3
							],
							"strides": [
								1,
								1
							],
							"padding": "valid",
							"data_format": "channels_last",
							"dilation_rate": [
								1,
								1
							],
							"groups": 1,
							"activation": "linear",
							"use_bias": false,
							"kernel_initializer": {
								"class_name": "HeNormal",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 9.999999747378752e-06
								}
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_5",
						"inbound_nodes": [
							[
								[
									"max_pooling2d_4",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_5",
							"trainable": true,
							"dtype": "float32",
							"axis": [
								3
							],
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"gamma_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"moving_mean_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"moving_variance_initializer": {
								"class_name": "Ones",
								"config": {}
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null
						},
						"name": "batch_normalization_5",
						"inbound_nodes": [
							[
								[
									"conv2d_5",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_5",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_5",
						"inbound_nodes": [
							[
								[
									"batch_normalization_5",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "MaxPooling2D",
						"config": {
							"name": "max_pooling2d_5",
							"trainable": true,
							"dtype": "float32",
							"pool_size": [
								2,
								2
							],
							"padding": "valid",
							"strides": [
								2,
								2
							],
							"data_format": "channels_last"
						},
						"name": "max_pooling2d_5",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_5",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Flatten",
						"config": {
							"name": "flatten",
							"trainable": true,
							"dtype": "float32",
							"data_format": "channels_last"
						},
						"name": "flatten",
						"inbound_nodes": [
							[
								[
									"max_pooling2d_5",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense",
							"trainable": true,
							"dtype": "float32",
							"units": 256,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"bias_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense",
						"inbound_nodes": [
							[
								[
									"flatten",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_6",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_6",
						"inbound_nodes": [
							[
								[
									"dense",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.6,
							"noise_shape": null,
							"seed": null
						},
						"name": "dropout",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_6",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_1",
							"trainable": true,
							"dtype": "float32",
							"units": 64,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"bias_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_1",
						"inbound_nodes": [
							[
								[
									"dropout",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_7",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_7",
						"inbound_nodes": [
							[
								[
									"dense_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_1",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.4,
							"noise_shape": null,
							"seed": null
						},
						"name": "dropout_1",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_7",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_2",
							"trainable": true,
							"dtype": "float32",
							"units": 32,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"bias_regularizer": {
								"class_name": "L2",
								"config": {
									"l2": 0.10000000149011612
								}
							},
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_2",
						"inbound_nodes": [
							[
								[
									"dropout_1",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "LeakyReLU",
						"config": {
							"name": "leaky_re_lu_8",
							"trainable": true,
							"dtype": "float32",
							"alpha": 0.20000000298023224
						},
						"name": "leaky_re_lu_8",
						"inbound_nodes": [
							[
								[
									"dense_2",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_2",
							"trainable": true,
							"dtype": "float32",
							"rate": 0.2,
							"noise_shape": null,
							"seed": null
						},
						"name": "dropout_2",
						"inbound_nodes": [
							[
								[
									"leaky_re_lu_8",
									0,
									0,
									{}
								]
							]
						]
					},
					{
						"class_name": "Dense",
						"config": {
							"name": "dense_3",
							"trainable": true,
							"dtype": "float32",
							"units": 1,
							"activation": "relu",
							"use_bias": true,
							"kernel_initializer": {
								"class_name": "GlorotUniform",
								"config": {
									"seed": null
								}
							},
							"bias_initializer": {
								"class_name": "Zeros",
								"config": {}
							},
							"kernel_regularizer": null,
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "dense_3",
						"inbound_nodes": [
							[
								[
									"dropout_2",
									0,
									0,
									{}
								]
							]
						]
					}
				],
				"input_layers": [
					[
						"input_1",
						0,
						0
					]
				],
				"output_layers": [
					[
						"dense_3",
						0,
						0
					]
				]
			}
		},
		"training_config": {
			"loss": "mean_absolute_error",
			"metrics": [
				[
					{
						"class_name": "MeanMetricWrapper",
						"config": {
							"name": "mae",
							"dtype": "float32",
							"fn": "mean_absolute_error"
						}
					}
				]
			],
			"weighted_metrics": null,
			"loss_weights": null,
			"optimizer_config": {
				"class_name": "Adam",
				"config": {
					"name": "Adam",
					"learning_rate": 9.500000305706635e-05,
					"decay": 0.0,
					"beta_1": 0.8999999761581421,
					"beta_2": 0.9990000128746033,
					"epsilon": 1e-07,
					"amsgrad": false
				}
			}
		}
	},
	"weightsManifest": [
		{
			"paths": [
				"group1-shard1of2.bin",
				"group1-shard2of2.bin"
			],
			"weights": [
				{
					"name": "batch_normalization/gamma",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization/beta",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization/moving_mean",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization/moving_variance",
					"shape": [
						16
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_1/gamma",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_1/beta",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_1/moving_mean",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_1/moving_variance",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_2/gamma",
					"shape": [
						64
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_2/beta",
					"shape": [
						64
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_2/moving_mean",
					"shape": [
						64
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_2/moving_variance",
					"shape": [
						64
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_3/gamma",
					"shape": [
						128
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_3/beta",
					"shape": [
						128
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_3/moving_mean",
					"shape": [
						128
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_3/moving_variance",
					"shape": [
						128
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_4/gamma",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_4/beta",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_4/moving_mean",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_4/moving_variance",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_5/gamma",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_5/beta",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_5/moving_mean",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "batch_normalization_5/moving_variance",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d/kernel",
					"shape": [
						3,
						3,
						3,
						16
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d_1/kernel",
					"shape": [
						3,
						3,
						16,
						32
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d_2/kernel",
					"shape": [
						3,
						3,
						32,
						64
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d_3/kernel",
					"shape": [
						3,
						3,
						64,
						128
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d_4/kernel",
					"shape": [
						3,
						3,
						128,
						256
					],
					"dtype": "float32"
				},
				{
					"name": "conv2d_5/kernel",
					"shape": [
						3,
						3,
						256,
						256
					],
					"dtype": "float32"
				},
				{
					"name": "dense/kernel",
					"shape": [
						256,
						256
					],
					"dtype": "float32"
				},
				{
					"name": "dense/bias",
					"shape": [
						256
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/kernel",
					"shape": [
						256,
						64
					],
					"dtype": "float32"
				},
				{
					"name": "dense_1/bias",
					"shape": [
						64
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/kernel",
					"shape": [
						64,
						32
					],
					"dtype": "float32"
				},
				{
					"name": "dense_2/bias",
					"shape": [
						32
					],
					"dtype": "float32"
				},
				{
					"name": "dense_3/kernel",
					"shape": [
						32,
						1
					],
					"dtype": "float32"
				},
				{
					"name": "dense_3/bias",
					"shape": [
						1
					],
					"dtype": "float32"
				}
			]
		}
	]
}